import numpy as np

# Нули и единицы
print('нули и единицы')
print(np.zeros((2, 3)))   # 2×3 из нулей
print(np.ones((3, 2)))    # 3×2 из единиц
print('-------------------')
# Единичная матрица
print('единичная матрица')
print(np.eye(4))          # 4×4, единицы на диагонали
print('-------------------')
# Последовательности
print('последовательности')
print(np.arange(0, 10, 2))   # 0, 2, 4, 6, 8
print('-------------------')
print(np.linspace(0, 1, 5))  # 5 чисел от 0 до 1 равномерно

print('-------------------')
# Равномерное распределение [0,1)
print('Равномерное распределение [0,1)')
print(np.random.rand(2, 3))

# Нормальное распределение (среднее=0, sigma=1)
print('Нормальное распределение (среднее=0, sigma=1)')
print(np.random.randn(3, 3))

# Случайные целые
print('random int')
print(np.random.randint(0, 10, (2, 4)))  # от 0 до 9, размер 2×4
print('-------------------')

